Revit 2027 API
IExternalService.OnServersDisparity Method
 Implements this method to get notified that the servers in a just opened document differ from those currently set as active for the service.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
DisparityResponse OnServersDisparity(
	Document document,
	IList<Guid> oldServers
)
Function OnServersDisparity (
	document As Document,
	oldServers As IList(Of Guid)
) As DisparityResponse
DisparityResponse OnServersDisparity(
	Document^ document,
	IList<Guid>^ oldServers
)
abstract OnServersDisparity :
        document : Document *
        oldServers : IList<Guid> -> DisparityResponse
Parameters
document Document
 The coresponding document
oldServers IList<Guid>
 Ids of servers previously used in the document. Please note that the Ids may belong to servers that are currently not registered with the service.
Return Value
DisparityResponse
 Return DoNothing if the situation has been completely handled by your service; If not, reply with either ApplyDefaults (typical case) or LetUserDecide.
Remarks
 This method may only be invoked in a recordable service. Services registered as non-recordable never receive this call.
 This notification is sent when Revit opens a document which has a record of the service used (executed at least once) and the record shows that the server (or servers) used differ from those currently set as active for the service.
 Unless the situation is explicitly handled in this call (by returning DoNothing), the framework will follow up by assigning the formerly used servers as the currently active servers of that document. After it will notify the service about the change by invoking the OnServersChanged method on the services interface.
See Also
Reference
IExternalService Interface
Autodesk.Revit.DB.ExternalService Namespace